Repository: soulsource/swaystatus
Catalog: swaystatus/translations/*.po
Languages: de

source: Failed to load library {}, no version information found.
de: Bibliothek {} konnte nicht geladen werden, sie enthält nicht die benötigten Versionsinformationen

source: Failed to load library {}, it was built with the wrong plugin version. Expected version {}, found version {}
de: Bibliothek {} konnte nicht geladen werden, sie wurde mit einer anderen Plugin-Schnittstellen-Version erstellt. Erwartete Version {}, fand Version {}

source: Failed to load library {}, it was built with a different Rust version. Since there is no ABI stability guaranteed, this safeguard is required. Please make sure this program and all plugins use the same compiler version. Expected the Rust version {}, found version {}
de: Bibliothek {} konnte nicht geladen werden, sie wurde mit einer anderen Rust-Version übersetzt. Diese Sicherheitsmaßnahme ist nötig, weil Rust nicht garantiert, dass die ABI über Versionsgrenzen kompatibel ist. Stellen Sie bitte sicher, dass sowohl das Hauptprogramm, als auch alle Bibliotheken mit dem gleichen Compiler übersetzt werden. Erwartete Version {}, fand Version {}

source: Failed to load library {}, it does not export the _swaystatus_module_create() function.
de: Bibliothek {} konnte nicht geladen werden, sie enthält nicht die benötigte _swaystatus_module_create() Funktion.

source: File I/O error while iterating libraries: {}
de: Ein-/Ausgabefehler beim Auflisten der Bibliotheken: {}

source: Failed to load as library: {}
de: Eintrag im Plugins-Ordner kann nicht als dynamische Bibliothek geladen werden: {}

source: I, element {}, tried to inform the main thread that I crashed. However the main thread isn't listening any more. This should be impossible, but well... Also, it's not critical enough to halt the whole program...
de: Ich, Element {}, habe versucht, dem Hauptprogramm mitzueilen, dass ich abgestürzt bin. Allerdings hört das Hauptprogramm nicht mehr zu. Das sollte eigentlich unmöglich sein, aber gut, es ist passiert... Naja, wird schon nicht so schlimm sein, dass es sinnvoll wäre das ganze Programm anzuhalten.

source: Failed to register signal handler. Since without signal handler there's no proper way to cleanly exit any plugins, we bail now.
de: Fehler beim Registrieren des Signal-Handlers. Da es ohne einen solchen nicht möglich ist, die Plugins sauber zu beenden, brechen wir lieber hier ab.

source: Message handler failed to send a message to main thread. This is supposed to be impossible. In any case it's a critical error.
de: Es trat ein Fehler beim Senden einer Nachricht vom Signal-Handler zum Haupt-Thread auf. Das sollte eigentlich unmöglich sein... Leider ist das ein kritischer Fehler.

source: A simple status text app, inspired by i3status
de: Eine einfache Status-Text Anwendung, inspiriert durch i3status

source: Prints help information.
de: Gibt Hilfe-Informationen aus.

source: Prints version information.
de: Gibt Versions-Informationen aus.

source: FILE
de: DATEI

source: Path to the configuration file
de: Pfad zur Konfigurationsdatei

source: FOLDER
de: ORDNER

source: Directory from which the plugins should be loaded
de: Ordner aus dem die Plugins geladen werden sollen.

source: Prints a sample config file. Beware that the contents of the sample file depend on the loaded plugins, so don't forget to supply the plugins parameter as needed.
de: Gibt eine Beispiel-Konfigurationsdatei aus. Bitte beachten Sie, dass der Inhalt dieses Beispiels von den momentan geladenen Plugins abhängt. Bitte vergessen Sie daher nicht, gegebenenfalls auch den Plugin-Ordner als Parameter anzugeben.

source: Prints plugin help messages. Either for a given list of plugins, or if no list given, for all loadable plugins.
de: Zeigt die Hilfe von Plugins an. Wenn eine Liste von Plugins angegebenwird, für Plugins in der Liste. Wenn keine Liste angegeben wird für allePlugins, die geladen werden können.

source: Prints a list of plugin names in the plugin folder.
de: Zeigt eine Liste aller Pluginnamen im Plugin-Ordner an.

source: If no config path is given, the code looks for the "swaystatus/config" file in your XDG config folder (typically "$HOME/.config/"). If that lookup fails, loading of "/etc/swaystatus/config" is attempted. Similarly, if no plugin folder is given, first the existence of a folder named "$HOME/.local/lib/swaystatus" is checked. If this folder does not exist, a default path set at compile time is used, which in your case is "{}".
de: Falls kein Pfad zur Konfigurationsdatei angegeben wird, sucht das Programm zuerst nach der Datei "swaystatus/config" in Ihrem persönlichen XDG Konfigurationsordner (üblicherweise "$HOME/.config/"). Sollte diese Datei nicht existieren, wird angenommen, dass sich die Konfiguration in "/etc/swaystatus/config" befindet. Bei den Plugins verhält es sich ähnlich. Falls Sie keinen Pfad explizit angeben, wird zuerst der Ordner "$HOME/.local/lib/swaystatus" gesucht. Gibt es diesen Ordner nicht, wird ein Pfad verwendet, der während des Übersetzens des Programmes festgelegt wurde. Momentan ist dieser "{}".

source: {before-help}{bin} {version} {author} {about} USAGE {usage} FLAGS: {flags} OPTIONS: {options} {after-help}
de: {before-help}{bin} {version} {author} {about} VERWENDUNG: {usage} SCHALTER: {flags} OPTIONEN: {options} {after-help}

source: No elements set up in configuration. Nothing to display.
de: In der Konfiguration sind keine Elemente zum Anzeigen definiert. Es gibt also nichts zu tun.

source: At least one of the plugins panicked. For details please check the (hopefully existing) previous error messages.
de: Mindestens ein Plugin ist abgestürzt. Mehr Details sollten in einer früheren Fehlermeldung (vom Zeitpunkt des Absturzes) ersichtlich sein.

source: The configuration file could not be read. Nothing to do.
de: Die Konfigurationsdatei konnte nicht gelesen werden. Es gibt daher nichts zu tun.

source: The parser for the config file returned an error: {}
de: Der Parser für die Konfigurationsdatei hat einen Fehler ausgegeben: {}

source: Tried to tell a plugin to quit, but that plugin seems to no longer listen to messages. Either that plugin has already terminated, or it's stuck. In the latter case a clean exit is impossible, you'll need to kill this process. The offending element is element number {} from plugin {}.
de: Es wurde versucht, ein Plugin zum Beenden aufzufordern. Allerdings scheint dieses Plugin nicht mehr auf Anweisungen des Hauptprogramms zu hören. Möglicherweise wurde es bereits beendet, oder aber es ist hängen geblieben. In letzterem Fall ist es nicht mehr möglich, das Plugin sauber zu beenden. Es kann daher notwendig sein, diesen Prozess per SIGKILL zu beenden. Das Element, das nicht mehr reagiert ist Nummer {}, aus dem Plugin {}.

source: Tried to tell a plugin to refresh, but it doesn't listen any more. Either the plugin already terminated, or it is stuck. The offending element is element number {} from plugin {}.
de: Es wurde versucht, ein Plugin zum Aktualisieren des Status-Textes aufzufordern. Allerdings scheint dieses Plugin nicht mehr auf Anweisungen aus dem Hauptprogramm zu hören. Möglicherweise wurde das Plugin bereits beendet, oder aber es ist hängen geblieben. In letzterem Fall ist es nicht mehr möglich, das Plugin sauber zu beenden. Es kann daher notwendig sein, diesen Prozess per SIGKILL zu beenden. Das Element, das nicht mehr reagiert ist Nummer {}, aus dem Plugin {}.

source: Element number {} (plugin: {}) sent an error message: {}
de: Element Nummer {} (Plugin: {}) hat eine Fehlermeldung geschickt: {}

source: <plugin crashed>
de: <Plugin abgestürzt>

source: The plugin {} crashed while displaying element number {}. Please see the plugin's panic message above for details.
de: Das Plugin {} für Element Nummer {} ist abgestürzt. Mehr Details sind in der Fehlermeldung des Plugins selbst ersichtlich (sollte gleich über dieser Meldung sein).

source: Tried to load plugins from folder "{}", but failed. You might want to set a plugin directory on the command line. The actual error was:
de: Der Versuch, Plugins aus dem Ordner "{}" zu laden schlug fehl. Es ist möglicherweise notwendig, einen Ordner als Kommandozeilenparameter anzugeben. Die genaue Fehlermeldung ist:

source: Plugin {} not found.
de: Das Plugin {} wurde nicht gefunden.
